def Controller():  #Функция меню
	CSS = input("Хотите повторить?\n1)Да\n2)Нет\nВы ввели: ") #Ввод действия с клавы
	if CSS == "1": #Проверка если 1 запуск программы снова
		Cleaner()
	elif CSS =="2": #Если 2 выйдет
		raise SystemExit(1) #Вырубает прогу
	else: #Если ты тупой и не можешь нажать на правильную цифру
		print("Я вас не понял повторите\n")
		Controller()

def Cleaner(): #Функция основы
	i=0 #Обнуление счётчика слова
	newpredloj="" #Переделанное предложение
	a = input("Введите предложение в котором после преобразования остануться только слова начинающиеся и заканчивающиеся на глассные, а так же имеющие длину 5 и более букв.\nВы ввели: ") #Ввод предложения
	wordsList = a.split() #Разбивка предложения на слова
	while i!=len(wordsList): #Цикл пока слова в списке есть работает
		if ((wordsList[i][0] in ["A","a","E","e","I","i","O","o","U","u","Y","y","а","А","я","Я","о","О","е","Е","у","У","ю","Ю","ы","Ы","и","И","э","Э","е","Е"]) and (wordsList[i][len(wordsList[i])-1] in ["A","a","E","e","I","i","O","o","U","u","Y","y","а","А","я","Я","о","О","е","Е","у","У","ю","Ю","ы","Ы","и","И","э","Э","е","Е"]) and len(wordsList[i])>4): #Эта длиная херня проверяет условия которое описанно в задаче
			newpredloj+=wordsList[i]+ " " #Прибавляет слово к новой строке
		i+=1 # +1 к счётчику
	print(newpredloj + "\n") #Выводит предложение
	Controller() #Запускает меню

Cleaner() #Старт программы с запускания основы
